checkfree/src/test/resources/expected/execute/soapWithList.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="urn:Corticon"><SOAP-ENV:Header/><SOAP-ENV:Body><ns0:CorticonRequest><ns0:WorkDocuments><ns0:Inquiry><ns0:assigned_email>1</ns0:assigned_email><ns0:assigned_name>2</ns0:assigned_name><ns0:campaign_id>3</ns0:campaign_id><ns0:country>4</ns0:country><ns0:decision_service>5</ns0:decision_service><ns0:event_type>6</ns0:event_type><ns0:industry>7</ns0:industry><ns0:method_of_distribution>8</ns0:method_of_distribution><ns0:named_rep>9</ns0:named_rep><ns0:ok_to_call>10</ns0:ok_to_call><ns0:organization_name>11</ns0:organization_name><ns0:organization_size>12</ns0:organization_size><ns0:post_code>13</ns0:post_code><ns0:preferredPartner>14</ns0:preferredPartner><ns0:prequalified>15</ns0:prequalified><ns0:priority>16</ns0:priority><ns0:product>17</ns0:product><ns0:product_family>18</ns0:product_family><ns0:product_quantity>19</ns0:product_quantity><ns0:province_state>20</ns0:province_state><ns0:purchase_timeframe>21</ns0:purchase_timeframe><ns0:reasonLeadRejected>22</ns0:reasonLeadRejected></ns0:Inquiry></ns0:WorkDocuments></ns0:CorticonRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>